SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/78YSI9N7CT/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESC!ICESMSLB\/RES.LB!1547211320383!2705!37</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-06-05T07:30" ArrivalDateTime="2019-06-05T10:35" FlightNumber="246" NumberInParty="1" ResBookDesigCode="E" Status="NN">      <DestinationLocation   LocationCode="YHZ"/>      <Equipment AirEquipType="73W"/>      <MarketingAirline Code="WS" FlightNumber="246"/>      <OperatingAirline Code="WS"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-06-05T22:55" ArrivalDateTime="2019-06-06T10:00" FlightNumber="80" NumberInParty="1" ResBookDesigCode="E" Status="NN">      <DestinationLocation   LocationCode="CDG"/>      <Equipment AirEquipType="7M8"/>      <MarketingAirline Code="WS" FlightNumber="80"/>      <OperatingAirline Code="WS"/>      <OriginLocation   LocationCode="YHZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-06-28T11:20" ArrivalDateTime="2019-06-28T13:35" FlightNumber="81" NumberInParty="1" ResBookDesigCode="E" Status="NN">      <DestinationLocation   LocationCode="YHZ"/>      <Equipment AirEquipType="7M8"/>      <MarketingAirline Code="WS" FlightNumber="81"/>      <OperatingAirline Code="WS"/>      <OriginLocation   LocationCode="CDG"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-06-28T19:05" ArrivalDateTime="2019-06-28T20:25" FlightNumber="275" NumberInParty="1" ResBookDesigCode="E" Status="NN">      <DestinationLocation   LocationCode="YYZ"/>      <Equipment AirEquipType="73W"/>      <MarketingAirline Code="WS" FlightNumber="275"/>      <OperatingAirline Code="WS"/>      <OriginLocation   LocationCode="YHZ"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>